["Eggplants aren’t REALLY vegetables, they’re berries. Which isn’t that strange, considering other fruits are commonly mistaken for vegetables – like tomatoes.", "Eggplants and tomatoes are actually related. They both belong to the nightshade family with the famous literary poison – deadly nightshade. But don’t worry, eggplant isn’t toxic (at least not in normal amounts).", "A study published in 1993 in the New England Journal of Medicine showed that eggplant has by far the highest level of nicotine of any vegetable. But it’s such a small amount that there’s really no need for concern. You would have to eat between 20 and 40 pounds of eggplant to consume the amount of nicotine you’d get smoking one cigarette.", "People in the U.K. called them aubergines. The word “aubergine” goes all the way back to the ancient Indian language Sanskrit. The eggplant is believed to have originated in India, where it is considered to be the King of Vegetables.", "Eggplant has spiny stem that can grow from 16 to 57 inches in height.", "Eggplant produces star-shaped, white or purple flowers. They contain both types of reproductive organs (pistil and stamens) and can perform self-pollination.", "Eggplant has short vegetative season. Harvest usually takes place 60 days after planting. Eggplant requires high temperature (it grows during the summer) for proper growth and development.", "Eggplant is rich source of dietary fibers, vitamins C, K and vitamins of the B group, and minerals such as copper, phosphorus and magnesium.", "Eggplant can be consumed grilled, baked, boiled, stuffed or combined with meat and other vegetables. Eggplant is often used as a substitute for meat in vegetarian diet due to specific texture and taste of its flesh.", "Juice made of leaves and roots of eggplant can be used in treatment of throat and stomach disorders, cough, asthma, toothache, rheumatism and skin problems.", "China is the greatest manufacturer of the eggplants in the world. It produces 28.800.000 tons of eggplants annually."]
